hellosamblack/CrowPanelProp/sdkconfig.defaults
# Target + board defaults for the communicator prop firmware.
# Generated as a starting point; run `idf.py set-target esp32p4` then `idf.py menuconfig` to refine.

CONFIG_IDF_TARGET="esp32p4"

# This board uses an early P4 (chip revision v1.3 / engineering sample). IDF 6.0
# defaults to v3.x silicon, which refuses to boot on it. Switch to the pre-v3
# line (supports rev 0.x/1.x, max v1.99) and set the minimum to v1.0.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Custom partition table with factory + ota_0 + ota_1 (copied from Lesson09) so WiFi OTA works.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Board has 16 MB flash; needed for the factory + ota_0 + ota_1 partition layout.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM (32 MB on board) — needed for LVGL framebuffers.
CONFIG_SPIRAM=y

# NOTE: do NOT raise CONFIG_LV_MEM_SIZE_KILOBYTES above 32 — esp_hosted's SDIO
# DMA mempool needs internal RAM and cannot move to PSRAM, so a bigger LV_MEM
# triggers "HS_MP: mempool create failed: no mem" and a boot loop (confirmed).
# Keep LVGL object count in check instead (lazy-build/tear-down SETUP panels).

# HTTP server: allow enough handlers + WebSocket support for the live control API.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# OTA rollback: on a fresh OTA boot the app is PENDING_VERIFY. If it doesn't call
# esp_ota_mark_app_valid_cancel_rollback() before the next reset the bootloader reverts
# to the previous partition. app_main calls this after full bring-up succeeds, so a
# bad image that crashes before that point auto-reverts without needing a USB reflash.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# FreeRTOS tick at 1 kHz for smooth animation timing.
CONFIG_FREERTOS_HZ=1000

# Main task stack: the IDF default (3584 B) is too tight once BT/NimBLE is enabled —
# app_main's bring-up (nvs_flash_init -> partition mmap, then engine/UI/net/BLE init)
# overruns it, and the overrun surfaces as the cryptic
# "esp_task_stack_is_sane_cache_disabled" assert during the first flash op. Give it room.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# esp_event's default "sys_evt" task stack (IDF default 2304 B) overflows the
# hardware stack guard intermittently right after WiFi STA gets its IP — the
# STA_GOT_IP -> mDNS registration -> netif handler callback chain it runs from
# that event apparently sits right at the edge. Caught 2026-07-01 via
# CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH's stack-canary panic ("Stack protection
# fault", task "sys_evt", SP 12 bytes below the stack's lower bound) after ~3
# reboots — this is very likely the same "intermittent boot-time panic" the
# Crash forensics section below was written to catch, just never previously
# pinned to a specific task. Bumped to 3584 B (same size as main_task) now that
# CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM frees the internal RAM to afford it.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584

# ESP32-C6 WiFi co-processor link (esp_hosted over SDIO). These pins are specific
# to the CrowPanel Advance V1.0 board (from the Lesson17 reference config): 1-bit
# SDIO on slot 1, slave reset on GPIO32. esp_hosted's defaults (reset GPIO54) do
# not match this board and cause "failed to read registers" SDIO timeouts.
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=32
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15

# Move esp_hosted's SDIO DMA mempool from internal RAM to PSRAM (2026-07-01). This
# is the same mempool the Crash forensics writeup (see the coredump comment below)
# blamed for leaving only 7168 B contiguous internal RAM at the exact point
# main_task's 8192 B stack needs to be allocated. The P4's PSRAM DMA is
# cache-coherent (unlike classic ESP32), so it's safe here despite esp_hosted's
# general "DMA buffers need internal RAM" guidance. Verified on hardware: clean
# boot (no "HS_MP: mempool create failed"), normal WiFi STA connect + BLE scan +
# 100 pkt/s traffic-gen load, and a same-uptime A/B against the prior default
# measured on the VITALS panel showed ~89 KB MORE internal free (216K vs 305K int
# at ~1 min uptime), matched almost exactly by ~89 KB less PSRAM free — a clean
# transfer, not noise. Worth retrying CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH below
# now that there's ~89 KB more internal headroom against the ~1.1 KB shortfall
# that broke it.
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y

# Build with -O2 (performance), not the IDF default -Og (debug). The UI is
# largely software-rendered by LVGL; the CRT overlay's full-screen ARGB8888 alpha
# blends from PSRAM are CPU-bound — -O2 speeds those pixel loops 2-4x and is a big
# frame-rate lever. (PPA hardware fill/blit is also enabled now — see CONFIG_LV_USE_PPA
# below; Espressif errata show no PPA defect on this rev v1.3 silicon.)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Crash forensics: an intermittent boot-time panic proved hard to catch with live
# serial capture (opening the port doesn't reliably line up with the exact reboot
# moment, and nobody's watching most of the time). Persist the full register dump +
# backtrace to the dedicated "coredump" flash partition (see partitions.csv) on any
# panic; read it back after the fact with
#   idf.py -C "f:\git\personal\CrowPanelProp" -p COM8 coredump-info
#
# Was TEMPORARILY DISABLED 2026-06-30: enabling this forces FREERTOS_ISR_STACKSIZE
# from 1536 to 2096 bytes/core (a documented ESP-IDF Kconfig floor:
# components/freertos/Kconfig, `range 2096 ... if ESP_COREDUMP_ENABLE`). That
# +1120 bytes lands in the narrow pre-scheduler window where main_task's own
# 8192-byte stack is allocated (before heap_caps_enable_nonos_stack_heaps() has
# reclaimed the startup stack — see freertos/app_startup.c) and previously
# starved it: measured `internal free=10832 largest=7168` bytes at that point
# with coredump on — total free exceeded what's needed, but the largest
# CONTIGUOUS block didn't, so esp_startup_start_app's
# xTaskCreatePinnedToCore(main_task, ...) failed outright (assert failed:
# esp_startup_start_app app_startup.c:83). Re-enabled 2026-07-01 now that
# CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM above frees ~89 KB of internal RAM
# (confirmed on hardware) against the ~1-1.5 KB shortfall that broke it —
# verified: fresh-flash boot is clean (no assert, no HS_MP mempool failure),
# and it survives a WiFi+BLE load test over 8 back-to-back reboots. If this ever
# regresses (e.g. mempool setting reverted), the fallback lever is still patching
# esp-hosted's hardcoded 5120-byte DFLT_TASK_STACK_SIZE (host/port/esp/freertos/
# include/port_esp_hosted_host_os.h) down, which needs vendoring the component
# into components/ since managed_components/ edits don't survive.
#
# Re-enabling this ALSO exposed (via its stack-canary check) a second, separate,
# genuinely-intermittent bug: see the CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE
# comment above (main task stack section) for the sys_evt stack overflow that
# was almost certainly the real cause of past "intermittent boot-time panic"
# reports — both are needed together for a reliably clean boot.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=n
CONFIG_ESP_COREDUMP_FLASH_NO_OVERWRITE=y

# RGB565 to match the EK79007 panel (LVGL 9 pairs this with the swap_bytes flag set
# in bsp_illuminate.c). Keep it explicit so a menuconfig reset can't drift it.
CONFIG_LV_COLOR_DEPTH_16=y

# LVGL default font (montserrat_14) stays on; the UI itself uses the custom Eurostile
# fonts, so the larger montserrat sizes are not needed.

# LVGL snapshot: lets the firmware capture the screen to a buffer for the
# /screenshot HTTP endpoint (remote visual verification during UI development).
CONFIG_LV_USE_SNAPSHOT=y

# BLE via the C6 controller (CONTACT SIGNATURES instrument). The C6 esp_hosted
# slave already runs the BLE controller; the P4 runs the NimBLE host and routes HCI
# to the C6 over the shared SDIO link (VHCI — no extra pins). NimBLE is lighter than
# Bluedroid. Roles trimmed to scan-only (observer/central) to keep internal RAM —
# esp_hosted's SDIO DMA mempool + WiFi already make it tight. If this triggers the
# "HS_MP: mempool create failed: no mem" boot loop, the lever is
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y (push WiFi/LWIP buffers to PSRAM), NOT
# shrinking LV_MEM. Reference: esp_hosted host_nimble_bleprph_host_only_vhci example.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# Route LVGL's heap to PSRAM via a custom allocator (main/lv_port_mem.c). LVGL 9 draws
# line/shape anti-alias masks through lv_malloc; the 32 KB builtin INTERNAL pool can't be
# raised (esp_hosted needs that RAM) and exhausts on instrument screens -> NULL ->
# Store-fault in draw_line_skew. PSRAM (32 MB) removes the ceiling, internal RAM untouched.
CONFIG_LV_USE_CUSTOM_MALLOC=y

# Second SW draw unit experiment: tested with DRAW_UNIT_CNT=2 + LV_OS_FREERTOS=y
# but the inter-unit FreeRTOS semaphore overhead outweighed the parallelism gain on
# spectrum (7-8 fps vs 12-20 fps with DRAW_UNIT_CNT=1). Keeping at 1.
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1

# Espressif PPA (Pixel-Processing Accelerator) draw unit — LVGL 9.4 ships an ESP32-P4
# PPA backend (lv_init.c calls lv_draw_ppa_init() when set). It bids ONLY on opaque
# square non-gradient FILLs (bar/background/card bodies); everything else stays on the
# SW draw unit, so it's inherently hybrid and can't force a bad op through hardware.
# The v1.3 errata show NO PPA/MIPI-DSI/L2/2D-DMA defect (MSPI-750 is v3.0-only); the
# earlier "broken silicon" belief was actually LVGL 8.4 having no PPA backend at all.
# Phase 0 of docs/superpowers/specs/2026-06-27-ppa-reenablement-framerate-plan.md.
CONFIG_LV_USE_PPA=y

# The LVGL PPA draw unit requires its draw/attribute buffers aligned to the L1 cache
# line (64 B on ESP32-P4) — lv_draw_ppa_private.h hard #errors otherwise. These were
# 4/1 under the pure-SW build; PPA's 2D-DMA reads/writes must start on a cache-line so
# the cache invalidate/writeback around each op is coherent. (STRIDE_ALIGN stays 1 —
# the guard only checks start-address + attribute alignment, and prop_fx's hand-packed
# ARGB canvas relies on a packed w*4 stride.)
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_ATTRIBUTE_MEM_ALIGN_SIZE=64
